In [1]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([10,20,30], index=['a', 'b', 'c'])
print("\n --SERIES--")
print(s)

 --SERIES--
a    10
b    20
c    30
dtype: int64

In [4]:
df=pd.DataFrame({
    'aluno':['Ana', 'Bruno', 'Carlos', 'Diana'],
    'turma':['A', 'B', 'A', 'B'],
    'nota':[8.0,6.5,9.0,5.5],
    'faltas':[2,5,0,3]
})

In [5]:
df

    aluno turma  nota  faltas
0     Ana     A   8.0       2
1   Bruno     B   6.5       5
2  Carlos     A   9.0       0
3   Diana     B   5.5       3

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   aluno   4 non-null      object
 1   turma   4 non-null      object
 2   nota    4 non-null      float64
 3   faltas  4 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 260.0+ bytes

In [8]:
df.describe()

           nota    faltas
count  4.000000  4.000000
mean   7.250000  2.500000
std    1.554563  2.081666
min    5.500000  0.000000
25%    6.250000  1.500000
50%    7.250000  2.500000
75%    8.250000  3.500000
max    9.000000  5.000000

In [13]:
df.head(2)

   aluno turma  nota  faltas
0    Ana     A   8.0       2
1  Bruno     B   6.5       5

In [14]:
df.tail(2)

    aluno turma  nota  faltas
2  Carlos     A   9.0       0
3   Diana     B   5.5       3

In [18]:
df.shape

(4, 4)

In [20]:
df.dtypes

aluno      object
turma      object
nota      float64
faltas      int64
dtype: object

In [21]:
df['faltas']

0    2
1    5
2    0
3    3
Name: faltas, dtype: int64

In [22]:
df.iloc[0]

aluno     Ana
turma       A
nota      8.0
faltas      2
Name: 0, dtype: object

In [23]:
df.loc[0:2, ['aluno', 'nota']]

    aluno  nota
0     Ana   8.0
1   Bruno   6.5
2  Carlos   9.0